Autodesk.Revit.DB.ExportPatternTable.GetEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.ExportPatternTable.GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
Returns: An IEnumerator object that can be used to iterate through the collection.

Autodesk.Revit.DB.ExportPatternTable.GetExportPatternTableIterator
Returns a ExportPatternTableIterator to the pattern table.
Since:
2014

Autodesk.Revit.DB.ExportPatternTable.Clear
Removes all contents stored in the table.
Since:
2014

Autodesk.Revit.DB.ExportPatternTable.Remove(Autodesk.Revit.DB.ExportPatternKey)
Removes the pair (key, info) by pattern key.
exportPatternKey:
The export pattern key.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportPatternTable.Add(Autodesk.Revit.DB.ExportPatternKey,Autodesk.Revit.DB.ExportPatternInfo)
Inserts a (key,info) pair into Export pattern table.
exportPatternKey:
The export pattern key to be added.
exportPatternInfo:
The export pattern info to be added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The key already exists in the table.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportPatternTable.GetValues
Returns all the values stored in the map.
Returns:
Return the info array.
Since:
2014

Autodesk.Revit.DB.ExportPatternTable.GetKeys
Gets all the keys stored in the map.
Returns:
Return the key array.
Since:
2014

Autodesk.Revit.DB.ExportPatternTable.GetExportPatternInfo(Autodesk.Revit.DB.ExportPatternKey)
Gets a copy of the pattern info associated to the input pattern key.
exportPatternKey:
The export pattern Key.
Returns:
Return the patternInfo for this key.
Throws Autodesk.Revit.Exceptions.ArgumentException:
An entry with the given key is not present in the table.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportPatternTable.ContainsKey(Autodesk.Revit.DB.ExportPatternKey)
Checks whether a pattern key exists in the table.
exportpatternKey:
The export pattern Key.
Returns:
True if the pattern key exists in the table.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ExportPatternTable.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExportPatternTable.Count
Count of the items contained in the collection.
Since:
2014

Autodesk.Revit.DB.ExportPatternTable.default(Autodesk.Revit.DB.ExportPatternKey)
A copy of the Autodesk.Revit.DB.ExportPatternInfo for the pattern's Autodesk.Revit.DB.ExportPatternKey.
Remarks: When getting this property, it returns a copy of the Autodesk.Revit.DB.ExportPatternInfo from the table.  In order to
make changes to the Autodesk.Revit.DB.ExportPatternInfo and use those settings during export, set the modified
Autodesk.Revit.DB.ExportPatternInfo back into the table using the same key.
exportPatternKey:
The key.
Returns:
A copy of the Autodesk.Revit.DB.ExportPatternInfo.
Throws Autodesk.Revit.Exceptions.ArgumentException: When getting this property:
An entry with the given key is not present in the table.
Since:
2014

Autodesk.Revit.DB.ExportPatternTable.GetPatternTableIterator
Returns a PatternTableIterator that iterates through the collection.
Returns: A PatternTableIterator object that can be used to iterate through key-value pairs in the collection.

Autodesk.Revit.DB.ExportPatternTable.#ctor
Constructs a new ExportPatternTable with default values.
Since:
2014

Autodesk.Revit.DB.ExportPatternTable
A table supporting a mapping of FillPatterns in Revit to pattern names that will be set
in the target export format.
Remarks:
This table is structured as a mapping from Autodesk.Revit.DB.ExportPatternKey to
Autodesk.Revit.DB.ExportPatternInfo members.  The Autodesk.Revit.DB.ExportPatternKey
contains the indentification information for the pattern table: the Revit fill pattern type and name.  The
Autodesk.Revit.DB.ExportPatternInfo contains the pattern name to use in the export format.
The table can be accessed via direct iteration as a collection of KeyValuePairs, or by traversal of the stored keys
obtained from GetKeys(), or via specific lookup of a key constructed externally.  In all cases, the
Autodesk.Revit.DB.ExportPatternInfo returned will be a copy of the Autodesk.Revit.DB.ExportPatternInfo
from the table.  In order to make changes to the Autodesk.Revit.DB.ExportPatternInfo and use those settings during export,
set the modified Autodesk.Revit.DB.ExportPatternInfo back into the table using the same key.
Since:
2014